print('参数补充:')
"""
形参:位置参数(就是def func(a,b):),默认参数(就是def func(a = 5,b = 9):),可变参数(就是def func(*args):),字典类型的可变参数(就是def func(**kwargs):)
实参:普通实参,关键字参数


形参使用顺序:位置参数 -->可变参数 -->默认参数 -->字典类型可变参数
实参使用顺序:普通实参 ---> 关键字参数

"""

"""位置参数和默认参数混合使用时,位置参数应该放在默认参数的前面"""

"""位置参数和可变参数混合使用时位置参数在可变参数的前面"""
#
#
# def func1(a, *args):
# 	print(a)
# 	print(args)
#
#
# func1(1, 2, 3, 4)

"""默认参数和可变参数混合使用:默认参数应该放在可变参数的后面"""


# 就是来收没人要的实参,可变参数不能用关键字参数的方式指定
def func2(*args, a=10):
	print(a)
	print(args)


func2(1, 2, 3)  # 10
# (1, 2, 3)
func2(1, 2, 3, a=20)  # 20,如果需要重新给a赋值,需要重新给a赋值(调用的时候叫关键字参数)
# (1, 2, 3)
